Rechnerubung/Week5/channel/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          60;
        startFace       71340;
    }
    outlet
    {
        type            patch;
        nFaces          60;
        startFace       71400;
    }
    fixedWalls-bottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          600;
        startFace       71460;
    }
    fixedWalls-top
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          600;
        startFace       72060;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          72000;
        startFace       72660;
    }
)

// ************************************************************************* //
