Rechnerubung/Week5/channel/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
type            sets;

libs            ("libsampling.so");

writeControl    writeTime;
interpolationScheme cellPoint;
setFormat       raw;



sets
(
    x_by_H_005
    {
        type    lineUniform;
        axis    y;
        start   (0.0005 0 0);
        end     (0.0005 0.002 0);
        nPoints 200;
    }

     x_by_H_02
    {
        type    lineUniform;
        axis    y;
        start   (0.002 0 0);
        end     (0.002 0.002 0);
        nPoints 200;
    }
    x_by_H_10
    {
        type    lineUniform;
        axis    y;
        start   (0.01 0 0);
        end     (0.01 0.002 0);
        nPoints 200;
    }
    
);

fields          (U);
// ************************************************************************* //
