Rechnerubung/Week5/channel/Allrun
#!/bin/bash

./Allclean

blockMesh

simpleFoam > log #&

# sleep 3
# echo "CTRL+C to abort the Residual-Task"
# foamMonitor -l postProcessing/residuals/0/residuals.dat
# sleep 1

postProcess -func sample -latestTime
postProcess -func "grad(U)"
./createGraphs
./createComparison.py
